; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p18---int100n150-m25---int100c200---s562---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 level107 level108 level109 level110 level111 level112 level113 level114 level115 level116 level117 level118 level119 level120 level121 level122 level123 level124 level125 level126 level127 level128 level129 level130 level131 level132 level133 level134 level135 level136 level137 level138 level139 level140 level141 level142 level143 level144 level145 level146 level147 level148 level149 level150 level151 level152 level153 level154 level155 level156 level157 level158 level159 level160 - fuellevel
)

(:init
(sum level0 level7 level7)
(sum level0 level14 level14)
(sum level0 level19 level19)
(sum level0 level21 level21)
(sum level0 level24 level24)
(sum level1 level7 level8)
(sum level1 level14 level15)
(sum level1 level19 level20)
(sum level1 level21 level22)
(sum level1 level24 level25)
(sum level2 level7 level9)
(sum level2 level14 level16)
(sum level2 level19 level21)
(sum level2 level21 level23)
(sum level2 level24 level26)
(sum level3 level7 level10)
(sum level3 level14 level17)
(sum level3 level19 level22)
(sum level3 level21 level24)
(sum level3 level24 level27)
(sum level4 level7 level11)
(sum level4 level14 level18)
(sum level4 level19 level23)
(sum level4 level21 level25)
(sum level4 level24 level28)
(sum level5 level7 level12)
(sum level5 level14 level19)
(sum level5 level19 level24)
(sum level5 level21 level26)
(sum level5 level24 level29)
(sum level6 level7 level13)
(sum level6 level14 level20)
(sum level6 level19 level25)
(sum level6 level21 level27)
(sum level6 level24 level30)
(sum level7 level7 level14)
(sum level7 level14 level21)
(sum level7 level19 level26)
(sum level7 level21 level28)
(sum level7 level24 level31)
(sum level8 level7 level15)
(sum level8 level14 level22)
(sum level8 level19 level27)
(sum level8 level21 level29)
(sum level8 level24 level32)
(sum level9 level7 level16)
(sum level9 level14 level23)
(sum level9 level19 level28)
(sum level9 level21 level30)
(sum level9 level24 level33)
(sum level10 level7 level17)
(sum level10 level14 level24)
(sum level10 level19 level29)
(sum level10 level21 level31)
(sum level10 level24 level34)
(sum level11 level7 level18)
(sum level11 level14 level25)
(sum level11 level19 level30)
(sum level11 level21 level32)
(sum level11 level24 level35)
(sum level12 level7 level19)
(sum level12 level14 level26)
(sum level12 level19 level31)
(sum level12 level21 level33)
(sum level12 level24 level36)
(sum level13 level7 level20)
(sum level13 level14 level27)
(sum level13 level19 level32)
(sum level13 level21 level34)
(sum level13 level24 level37)
(sum level14 level7 level21)
(sum level14 level14 level28)
(sum level14 level19 level33)
(sum level14 level21 level35)
(sum level14 level24 level38)
(sum level15 level7 level22)
(sum level15 level14 level29)
(sum level15 level19 level34)
(sum level15 level21 level36)
(sum level15 level24 level39)
(sum level16 level7 level23)
(sum level16 level14 level30)
(sum level16 level19 level35)
(sum level16 level21 level37)
(sum level16 level24 level40)
(sum level17 level7 level24)
(sum level17 level14 level31)
(sum level17 level19 level36)
(sum level17 level21 level38)
(sum level17 level24 level41)
(sum level18 level7 level25)
(sum level18 level14 level32)
(sum level18 level19 level37)
(sum level18 level21 level39)
(sum level18 level24 level42)
(sum level19 level7 level26)
(sum level19 level14 level33)
(sum level19 level19 level38)
(sum level19 level21 level40)
(sum level19 level24 level43)
(sum level20 level7 level27)
(sum level20 level14 level34)
(sum level20 level19 level39)
(sum level20 level21 level41)
(sum level20 level24 level44)
(sum level21 level7 level28)
(sum level21 level14 level35)
(sum level21 level19 level40)
(sum level21 level21 level42)
(sum level21 level24 level45)
(sum level22 level7 level29)
(sum level22 level14 level36)
(sum level22 level19 level41)
(sum level22 level21 level43)
(sum level22 level24 level46)
(sum level23 level7 level30)
(sum level23 level14 level37)
(sum level23 level19 level42)
(sum level23 level21 level44)
(sum level23 level24 level47)
(sum level24 level7 level31)
(sum level24 level14 level38)
(sum level24 level19 level43)
(sum level24 level21 level45)
(sum level24 level24 level48)
(sum level25 level7 level32)
(sum level25 level14 level39)
(sum level25 level19 level44)
(sum level25 level21 level46)
(sum level25 level24 level49)
(sum level26 level7 level33)
(sum level26 level14 level40)
(sum level26 level19 level45)
(sum level26 level21 level47)
(sum level26 level24 level50)
(sum level27 level7 level34)
(sum level27 level14 level41)
(sum level27 level19 level46)
(sum level27 level21 level48)
(sum level27 level24 level51)
(sum level28 level7 level35)
(sum level28 level14 level42)
(sum level28 level19 level47)
(sum level28 level21 level49)
(sum level28 level24 level52)
(sum level29 level7 level36)
(sum level29 level14 level43)
(sum level29 level19 level48)
(sum level29 level21 level50)
(sum level29 level24 level53)
(sum level30 level7 level37)
(sum level30 level14 level44)
(sum level30 level19 level49)
(sum level30 level21 level51)
(sum level30 level24 level54)
(sum level31 level7 level38)
(sum level31 level14 level45)
(sum level31 level19 level50)
(sum level31 level21 level52)
(sum level31 level24 level55)
(sum level32 level7 level39)
(sum level32 level14 level46)
(sum level32 level19 level51)
(sum level32 level21 level53)
(sum level32 level24 level56)
(sum level33 level7 level40)
(sum level33 level14 level47)
(sum level33 level19 level52)
(sum level33 level21 level54)
(sum level33 level24 level57)
(sum level34 level7 level41)
(sum level34 level14 level48)
(sum level34 level19 level53)
(sum level34 level21 level55)
(sum level34 level24 level58)
(sum level35 level7 level42)
(sum level35 level14 level49)
(sum level35 level19 level54)
(sum level35 level21 level56)
(sum level35 level24 level59)
(sum level36 level7 level43)
(sum level36 level14 level50)
(sum level36 level19 level55)
(sum level36 level21 level57)
(sum level36 level24 level60)
(sum level37 level7 level44)
(sum level37 level14 level51)
(sum level37 level19 level56)
(sum level37 level21 level58)
(sum level37 level24 level61)
(sum level38 level7 level45)
(sum level38 level14 level52)
(sum level38 level19 level57)
(sum level38 level21 level59)
(sum level38 level24 level62)
(sum level39 level7 level46)
(sum level39 level14 level53)
(sum level39 level19 level58)
(sum level39 level21 level60)
(sum level39 level24 level63)
(sum level40 level7 level47)
(sum level40 level14 level54)
(sum level40 level19 level59)
(sum level40 level21 level61)
(sum level40 level24 level64)
(sum level41 level7 level48)
(sum level41 level14 level55)
(sum level41 level19 level60)
(sum level41 level21 level62)
(sum level41 level24 level65)
(sum level42 level7 level49)
(sum level42 level14 level56)
(sum level42 level19 level61)
(sum level42 level21 level63)
(sum level42 level24 level66)
(sum level43 level7 level50)
(sum level43 level14 level57)
(sum level43 level19 level62)
(sum level43 level21 level64)
(sum level43 level24 level67)
(sum level44 level7 level51)
(sum level44 level14 level58)
(sum level44 level19 level63)
(sum level44 level21 level65)
(sum level44 level24 level68)
(sum level45 level7 level52)
(sum level45 level14 level59)
(sum level45 level19 level64)
(sum level45 level21 level66)
(sum level45 level24 level69)
(sum level46 level7 level53)
(sum level46 level14 level60)
(sum level46 level19 level65)
(sum level46 level21 level67)
(sum level46 level24 level70)
(sum level47 level7 level54)
(sum level47 level14 level61)
(sum level47 level19 level66)
(sum level47 level21 level68)
(sum level47 level24 level71)
(sum level48 level7 level55)
(sum level48 level14 level62)
(sum level48 level19 level67)
(sum level48 level21 level69)
(sum level48 level24 level72)
(sum level49 level7 level56)
(sum level49 level14 level63)
(sum level49 level19 level68)
(sum level49 level21 level70)
(sum level49 level24 level73)
(sum level50 level7 level57)
(sum level50 level14 level64)
(sum level50 level19 level69)
(sum level50 level21 level71)
(sum level50 level24 level74)
(sum level51 level7 level58)
(sum level51 level14 level65)
(sum level51 level19 level70)
(sum level51 level21 level72)
(sum level51 level24 level75)
(sum level52 level7 level59)
(sum level52 level14 level66)
(sum level52 level19 level71)
(sum level52 level21 level73)
(sum level52 level24 level76)
(sum level53 level7 level60)
(sum level53 level14 level67)
(sum level53 level19 level72)
(sum level53 level21 level74)
(sum level53 level24 level77)
(sum level54 level7 level61)
(sum level54 level14 level68)
(sum level54 level19 level73)
(sum level54 level21 level75)
(sum level54 level24 level78)
(sum level55 level7 level62)
(sum level55 level14 level69)
(sum level55 level19 level74)
(sum level55 level21 level76)
(sum level55 level24 level79)
(sum level56 level7 level63)
(sum level56 level14 level70)
(sum level56 level19 level75)
(sum level56 level21 level77)
(sum level56 level24 level80)
(sum level57 level7 level64)
(sum level57 level14 level71)
(sum level57 level19 level76)
(sum level57 level21 level78)
(sum level57 level24 level81)
(sum level58 level7 level65)
(sum level58 level14 level72)
(sum level58 level19 level77)
(sum level58 level21 level79)
(sum level58 level24 level82)
(sum level59 level7 level66)
(sum level59 level14 level73)
(sum level59 level19 level78)
(sum level59 level21 level80)
(sum level59 level24 level83)
(sum level60 level7 level67)
(sum level60 level14 level74)
(sum level60 level19 level79)
(sum level60 level21 level81)
(sum level60 level24 level84)
(sum level61 level7 level68)
(sum level61 level14 level75)
(sum level61 level19 level80)
(sum level61 level21 level82)
(sum level61 level24 level85)
(sum level62 level7 level69)
(sum level62 level14 level76)
(sum level62 level19 level81)
(sum level62 level21 level83)
(sum level62 level24 level86)
(sum level63 level7 level70)
(sum level63 level14 level77)
(sum level63 level19 level82)
(sum level63 level21 level84)
(sum level63 level24 level87)
(sum level64 level7 level71)
(sum level64 level14 level78)
(sum level64 level19 level83)
(sum level64 level21 level85)
(sum level64 level24 level88)
(sum level65 level7 level72)
(sum level65 level14 level79)
(sum level65 level19 level84)
(sum level65 level21 level86)
(sum level65 level24 level89)
(sum level66 level7 level73)
(sum level66 level14 level80)
(sum level66 level19 level85)
(sum level66 level21 level87)
(sum level66 level24 level90)
(sum level67 level7 level74)
(sum level67 level14 level81)
(sum level67 level19 level86)
(sum level67 level21 level88)
(sum level67 level24 level91)
(sum level68 level7 level75)
(sum level68 level14 level82)
(sum level68 level19 level87)
(sum level68 level21 level89)
(sum level68 level24 level92)
(sum level69 level7 level76)
(sum level69 level14 level83)
(sum level69 level19 level88)
(sum level69 level21 level90)
(sum level69 level24 level93)
(sum level70 level7 level77)
(sum level70 level14 level84)
(sum level70 level19 level89)
(sum level70 level21 level91)
(sum level70 level24 level94)
(sum level71 level7 level78)
(sum level71 level14 level85)
(sum level71 level19 level90)
(sum level71 level21 level92)
(sum level71 level24 level95)
(sum level72 level7 level79)
(sum level72 level14 level86)
(sum level72 level19 level91)
(sum level72 level21 level93)
(sum level72 level24 level96)
(sum level73 level7 level80)
(sum level73 level14 level87)
(sum level73 level19 level92)
(sum level73 level21 level94)
(sum level73 level24 level97)
(sum level74 level7 level81)
(sum level74 level14 level88)
(sum level74 level19 level93)
(sum level74 level21 level95)
(sum level74 level24 level98)
(sum level75 level7 level82)
(sum level75 level14 level89)
(sum level75 level19 level94)
(sum level75 level21 level96)
(sum level75 level24 level99)
(sum level76 level7 level83)
(sum level76 level14 level90)
(sum level76 level19 level95)
(sum level76 level21 level97)
(sum level76 level24 level100)
(sum level77 level7 level84)
(sum level77 level14 level91)
(sum level77 level19 level96)
(sum level77 level21 level98)
(sum level77 level24 level101)
(sum level78 level7 level85)
(sum level78 level14 level92)
(sum level78 level19 level97)
(sum level78 level21 level99)
(sum level78 level24 level102)
(sum level79 level7 level86)
(sum level79 level14 level93)
(sum level79 level19 level98)
(sum level79 level21 level100)
(sum level79 level24 level103)
(sum level80 level7 level87)
(sum level80 level14 level94)
(sum level80 level19 level99)
(sum level80 level21 level101)
(sum level80 level24 level104)
(sum level81 level7 level88)
(sum level81 level14 level95)
(sum level81 level19 level100)
(sum level81 level21 level102)
(sum level81 level24 level105)
(sum level82 level7 level89)
(sum level82 level14 level96)
(sum level82 level19 level101)
(sum level82 level21 level103)
(sum level82 level24 level106)
(sum level83 level7 level90)
(sum level83 level14 level97)
(sum level83 level19 level102)
(sum level83 level21 level104)
(sum level83 level24 level107)
(sum level84 level7 level91)
(sum level84 level14 level98)
(sum level84 level19 level103)
(sum level84 level21 level105)
(sum level84 level24 level108)
(sum level85 level7 level92)
(sum level85 level14 level99)
(sum level85 level19 level104)
(sum level85 level21 level106)
(sum level85 level24 level109)
(sum level86 level7 level93)
(sum level86 level14 level100)
(sum level86 level19 level105)
(sum level86 level21 level107)
(sum level86 level24 level110)
(sum level87 level7 level94)
(sum level87 level14 level101)
(sum level87 level19 level106)
(sum level87 level21 level108)
(sum level87 level24 level111)
(sum level88 level7 level95)
(sum level88 level14 level102)
(sum level88 level19 level107)
(sum level88 level21 level109)
(sum level88 level24 level112)
(sum level89 level7 level96)
(sum level89 level14 level103)
(sum level89 level19 level108)
(sum level89 level21 level110)
(sum level89 level24 level113)
(sum level90 level7 level97)
(sum level90 level14 level104)
(sum level90 level19 level109)
(sum level90 level21 level111)
(sum level90 level24 level114)
(sum level91 level7 level98)
(sum level91 level14 level105)
(sum level91 level19 level110)
(sum level91 level21 level112)
(sum level91 level24 level115)
(sum level92 level7 level99)
(sum level92 level14 level106)
(sum level92 level19 level111)
(sum level92 level21 level113)
(sum level92 level24 level116)
(sum level93 level7 level100)
(sum level93 level14 level107)
(sum level93 level19 level112)
(sum level93 level21 level114)
(sum level93 level24 level117)
(sum level94 level7 level101)
(sum level94 level14 level108)
(sum level94 level19 level113)
(sum level94 level21 level115)
(sum level94 level24 level118)
(sum level95 level7 level102)
(sum level95 level14 level109)
(sum level95 level19 level114)
(sum level95 level21 level116)
(sum level95 level24 level119)
(sum level96 level7 level103)
(sum level96 level14 level110)
(sum level96 level19 level115)
(sum level96 level21 level117)
(sum level96 level24 level120)
(sum level97 level7 level104)
(sum level97 level14 level111)
(sum level97 level19 level116)
(sum level97 level21 level118)
(sum level97 level24 level121)
(sum level98 level7 level105)
(sum level98 level14 level112)
(sum level98 level19 level117)
(sum level98 level21 level119)
(sum level98 level24 level122)
(sum level99 level7 level106)
(sum level99 level14 level113)
(sum level99 level19 level118)
(sum level99 level21 level120)
(sum level99 level24 level123)
(sum level100 level7 level107)
(sum level100 level14 level114)
(sum level100 level19 level119)
(sum level100 level21 level121)
(sum level100 level24 level124)
(sum level101 level7 level108)
(sum level101 level14 level115)
(sum level101 level19 level120)
(sum level101 level21 level122)
(sum level101 level24 level125)
(sum level102 level7 level109)
(sum level102 level14 level116)
(sum level102 level19 level121)
(sum level102 level21 level123)
(sum level102 level24 level126)
(sum level103 level7 level110)
(sum level103 level14 level117)
(sum level103 level19 level122)
(sum level103 level21 level124)
(sum level103 level24 level127)
(sum level104 level7 level111)
(sum level104 level14 level118)
(sum level104 level19 level123)
(sum level104 level21 level125)
(sum level104 level24 level128)
(sum level105 level7 level112)
(sum level105 level14 level119)
(sum level105 level19 level124)
(sum level105 level21 level126)
(sum level105 level24 level129)
(sum level106 level7 level113)
(sum level106 level14 level120)
(sum level106 level19 level125)
(sum level106 level21 level127)
(sum level106 level24 level130)
(sum level107 level7 level114)
(sum level107 level14 level121)
(sum level107 level19 level126)
(sum level107 level21 level128)
(sum level107 level24 level131)
(sum level108 level7 level115)
(sum level108 level14 level122)
(sum level108 level19 level127)
(sum level108 level21 level129)
(sum level108 level24 level132)
(sum level109 level7 level116)
(sum level109 level14 level123)
(sum level109 level19 level128)
(sum level109 level21 level130)
(sum level109 level24 level133)
(sum level110 level7 level117)
(sum level110 level14 level124)
(sum level110 level19 level129)
(sum level110 level21 level131)
(sum level110 level24 level134)
(sum level111 level7 level118)
(sum level111 level14 level125)
(sum level111 level19 level130)
(sum level111 level21 level132)
(sum level111 level24 level135)
(sum level112 level7 level119)
(sum level112 level14 level126)
(sum level112 level19 level131)
(sum level112 level21 level133)
(sum level112 level24 level136)
(sum level113 level7 level120)
(sum level113 level14 level127)
(sum level113 level19 level132)
(sum level113 level21 level134)
(sum level113 level24 level137)
(sum level114 level7 level121)
(sum level114 level14 level128)
(sum level114 level19 level133)
(sum level114 level21 level135)
(sum level114 level24 level138)
(sum level115 level7 level122)
(sum level115 level14 level129)
(sum level115 level19 level134)
(sum level115 level21 level136)
(sum level115 level24 level139)
(sum level116 level7 level123)
(sum level116 level14 level130)
(sum level116 level19 level135)
(sum level116 level21 level137)
(sum level116 level24 level140)
(sum level117 level7 level124)
(sum level117 level14 level131)
(sum level117 level19 level136)
(sum level117 level21 level138)
(sum level117 level24 level141)
(sum level118 level7 level125)
(sum level118 level14 level132)
(sum level118 level19 level137)
(sum level118 level21 level139)
(sum level118 level24 level142)
(sum level119 level7 level126)
(sum level119 level14 level133)
(sum level119 level19 level138)
(sum level119 level21 level140)
(sum level119 level24 level143)
(sum level120 level7 level127)
(sum level120 level14 level134)
(sum level120 level19 level139)
(sum level120 level21 level141)
(sum level120 level24 level144)
(sum level121 level7 level128)
(sum level121 level14 level135)
(sum level121 level19 level140)
(sum level121 level21 level142)
(sum level121 level24 level145)
(sum level122 level7 level129)
(sum level122 level14 level136)
(sum level122 level19 level141)
(sum level122 level21 level143)
(sum level122 level24 level146)
(sum level123 level7 level130)
(sum level123 level14 level137)
(sum level123 level19 level142)
(sum level123 level21 level144)
(sum level123 level24 level147)
(sum level124 level7 level131)
(sum level124 level14 level138)
(sum level124 level19 level143)
(sum level124 level21 level145)
(sum level124 level24 level148)
(sum level125 level7 level132)
(sum level125 level14 level139)
(sum level125 level19 level144)
(sum level125 level21 level146)
(sum level125 level24 level149)
(sum level126 level7 level133)
(sum level126 level14 level140)
(sum level126 level19 level145)
(sum level126 level21 level147)
(sum level126 level24 level150)
(sum level127 level7 level134)
(sum level127 level14 level141)
(sum level127 level19 level146)
(sum level127 level21 level148)
(sum level127 level24 level151)
(sum level128 level7 level135)
(sum level128 level14 level142)
(sum level128 level19 level147)
(sum level128 level21 level149)
(sum level128 level24 level152)
(sum level129 level7 level136)
(sum level129 level14 level143)
(sum level129 level19 level148)
(sum level129 level21 level150)
(sum level129 level24 level153)
(sum level130 level7 level137)
(sum level130 level14 level144)
(sum level130 level19 level149)
(sum level130 level21 level151)
(sum level130 level24 level154)
(sum level131 level7 level138)
(sum level131 level14 level145)
(sum level131 level19 level150)
(sum level131 level21 level152)
(sum level131 level24 level155)
(sum level132 level7 level139)
(sum level132 level14 level146)
(sum level132 level19 level151)
(sum level132 level21 level153)
(sum level132 level24 level156)
(sum level133 level7 level140)
(sum level133 level14 level147)
(sum level133 level19 level152)
(sum level133 level21 level154)
(sum level133 level24 level157)
(sum level134 level7 level141)
(sum level134 level14 level148)
(sum level134 level19 level153)
(sum level134 level21 level155)
(sum level134 level24 level158)
(sum level135 level7 level142)
(sum level135 level14 level149)
(sum level135 level19 level154)
(sum level135 level21 level156)
(sum level135 level24 level159)
(sum level136 level7 level143)
(sum level136 level14 level150)
(sum level136 level19 level155)
(sum level136 level21 level157)
(sum level136 level24 level160)
(sum level137 level7 level144)
(sum level137 level14 level151)
(sum level137 level19 level156)
(sum level137 level21 level158)
(sum level138 level7 level145)
(sum level138 level14 level152)
(sum level138 level19 level157)
(sum level138 level21 level159)
(sum level139 level7 level146)
(sum level139 level14 level153)
(sum level139 level19 level158)
(sum level139 level21 level160)
(sum level140 level7 level147)
(sum level140 level14 level154)
(sum level140 level19 level159)
(sum level141 level7 level148)
(sum level141 level14 level155)
(sum level141 level19 level160)
(sum level142 level7 level149)
(sum level142 level14 level156)
(sum level143 level7 level150)
(sum level143 level14 level157)
(sum level144 level7 level151)
(sum level144 level14 level158)
(sum level145 level7 level152)
(sum level145 level14 level159)
(sum level146 level7 level153)
(sum level146 level14 level160)
(sum level147 level7 level154)
(sum level148 level7 level155)
(sum level149 level7 level156)
(sum level150 level7 level157)
(sum level151 level7 level158)
(sum level152 level7 level159)
(sum level153 level7 level160)

(connected l0 l1)
(fuelcost level21 l0 l1)
(connected l0 l2)
(fuelcost level14 l0 l2)
(connected l0 l3)
(fuelcost level19 l0 l3)
(connected l1 l0)
(fuelcost level21 l1 l0)
(connected l1 l2)
(fuelcost level7 l1 l2)
(connected l1 l3)
(fuelcost level24 l1 l3)
(connected l2 l0)
(fuelcost level14 l2 l0)
(connected l2 l1)
(fuelcost level7 l2 l1)
(connected l2 l3)
(fuelcost level14 l2 l3)
(connected l3 l0)
(fuelcost level19 l3 l0)
(connected l3 l1)
(fuelcost level24 l3 l1)
(connected l3 l2)
(fuelcost level14 l3 l2)

(at t0 l3)
(fuel t0 level160)
(= (total-cost) 0)

(at p0 l0)
(at p1 l1)
(at p2 l0)
(at p3 l1)
(at p4 l2)
(at p5 l1)
(at p6 l1)
(at p7 l2)
(at p8 l1)
(at p9 l3)
(at p10 l1)
(at p11 l0)
(at p12 l0)
(at p13 l2)
(at p14 l0)
(at p15 l0)
(at p16 l2)
(at p17 l3)
)

(:goal
(and
(at p0 l2)
(at p1 l0)
(at p2 l1)
(at p3 l2)
(at p4 l3)
(at p5 l0)
(at p6 l0)
(at p7 l3)
(at p8 l0)
(at p9 l2)
(at p10 l0)
(at p11 l1)
(at p12 l3)
(at p13 l0)
(at p14 l1)
(at p15 l1)
(at p16 l1)
(at p17 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p9 t0 l3)
   deleted: (at p9 l3)
   added: (in p9 t0)
   goals met: 0 of 18
2. (load p17 t0 l3)
   deleted: (at p17 l3)
   added: (in p17 t0)
   goals met: 0 of 18
3. (drive t0 l3 l1 level136 level24 level160)
   deleted: (at t0 l3) (fuel t0 level160)
   added: (at t0 l1) (fuel t0 level136)
   goals met: 0 of 18
4. (load p8 t0 l1)
   deleted: (at p8 l1)
   added: (in p8 t0)
   goals met: 0 of 18
5. (load p6 t0 l1)
   deleted: (at p6 l1)
   added: (in p6 t0)
   goals met: 0 of 18
6. (load p5 t0 l1)
   deleted: (at p5 l1)
   added: (in p5 t0)
   goals met: 0 of 18
7. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 0 of 18
8. (load p10 t0 l1)
   deleted: (at p10 l1)
   added: (in p10 t0)
   goals met: 0 of 18
9. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 0 of 18
10. (drive t0 l1 l2 level129 level7 level136)
   deleted: (at t0 l1) (fuel t0 level136)
   added: (at t0 l2) (fuel t0 level129)
   goals met: 0 of 18
11. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 1 of 18
12. (load p7 t0 l2)
   deleted: (at p7 l2)
   added: (in p7 t0)
   goals met: 1 of 18
13. (load p4 t0 l2)
   deleted: (at p4 l2)
   added: (in p4 t0)
   goals met: 1 of 18
14. (load p16 t0 l2)
   deleted: (at p16 l2)
   added: (in p16 t0)
   goals met: 1 of 18
15. (load p13 t0 l2)
   deleted: (at p13 l2)
   added: (in p13 t0)
   goals met: 1 of 18
16. (drive t0 l2 l0 level115 level14 level129)
   deleted: (at t0 l2) (fuel t0 level129)
   added: (at t0 l0) (fuel t0 level115)
   goals met: 1 of 18
17. (unload p8 t0 l0)
   deleted: (in p8 t0)
   added: (at p8 l0)
   goals met: 2 of 18
18. (unload p6 t0 l0)
   deleted: (in p6 t0)
   added: (at p6 l0)
   goals met: 3 of 18
19. (unload p5 t0 l0)
   deleted: (in p5 t0)
   added: (at p5 l0)
   goals met: 4 of 18
20. (unload p17 t0 l0)
   deleted: (in p17 t0)
   added: (at p17 l0)
   goals met: 5 of 18
21. (unload p13 t0 l0)
   deleted: (in p13 t0)
   added: (at p13 l0)
   goals met: 6 of 18
22. (unload p10 t0 l0)
   deleted: (in p10 t0)
   added: (at p10 l0)
   goals met: 7 of 18
23. (unload p1 t0 l0)
   deleted: (in p1 t0)
   added: (at p1 l0)
   goals met: 8 of 18
24. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 8 of 18
25. (load p15 t0 l0)
   deleted: (at p15 l0)
   added: (in p15 t0)
   goals met: 8 of 18
26. (load p14 t0 l0)
   deleted: (at p14 l0)
   added: (in p14 t0)
   goals met: 8 of 18
27. (load p12 t0 l0)
   deleted: (at p12 l0)
   added: (in p12 t0)
   goals met: 8 of 18
28. (load p11 t0 l0)
   deleted: (at p11 l0)
   added: (in p11 t0)
   goals met: 8 of 18
29. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 8 of 18
30. (drive t0 l0 l1 level94 level21 level115)
   deleted: (at t0 l0) (fuel t0 level115)
   added: (at t0 l1) (fuel t0 level94)
   goals met: 8 of 18
31. (unload p11 t0 l1)
   deleted: (in p11 t0)
   added: (at p11 l1)
   goals met: 9 of 18
32. (unload p14 t0 l1)
   deleted: (in p14 t0)
   added: (at p14 l1)
   goals met: 10 of 18
33. (unload p15 t0 l1)
   deleted: (in p15 t0)
   added: (at p15 l1)
   goals met: 11 of 18
34. (unload p16 t0 l1)
   deleted: (in p16 t0)
   added: (at p16 l1)
   goals met: 12 of 18
35. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 13 of 18
36. (drive t0 l1 l2 level87 level7 level94)
   deleted: (at t0 l1) (fuel t0 level94)
   added: (at t0 l2) (fuel t0 level87)
   goals met: 13 of 18
37. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 14 of 18
38. (unload p9 t0 l2)
   deleted: (in p9 t0)
   added: (at p9 l2)
   goals met: 15 of 18
39. (drive t0 l2 l3 level73 level14 level87)
   deleted: (at t0 l2) (fuel t0 level87)
   added: (at t0 l3) (fuel t0 level73)
   goals met: 15 of 18
40. (unload p12 t0 l3)
   deleted: (in p12 t0)
   added: (at p12 l3)
   goals met: 16 of 18
41. (unload p4 t0 l3)
   deleted: (in p4 t0)
   added: (at p4 l3)
   goals met: 17 of 18
42. (unload p7 t0 l3)
   deleted: (in p7 t0)
   added: (at p7 l3)
   goals met: 18 of 18
